// 1) Дан массив с элементами [1, 2, 3, 4, 5]. С помощью цикла for найдите
//     сумму элементов этого массива. Запишите ее в переменную result.

// let sum = 0;
// const num = [1, 2, 3, 4, 5];
// for( let i = 0; i < num.length; i++)
//     sum += num[i]
//
// console.log(sum)

// 3) Дан массив с элементами [1, 2, 5, 9, 4, 13, 4, 10].
//     С помощью цикла for и оператора if проверьте есть ли в массиве элемент со значением, равным 4.
// Если есть - выведите на экран 'Есть!' и выйдите из цикла. Если нет - ничего делать не надо.

// const numbers = [1,2,5,9,4,13,4,10]
// let four = []
// for(let i = 0; i < numbers.length; i++)
//     if (numbers.includes(4)){
//         four = 'finded'
//     } else {
//
//     }
//
// console.log(four)